from pylab import *

mpl.rcParams['font.sans-serif'] = ['Arial']
plt.figure(figsize=(8, 7))
# 数据
"""
LassoCV 
['血_球蛋白','高血压(0=无，1=有)','血_淋巴细胞(%)','年龄','血_尿酸','血_白/球比值',
'血_乳酸脱氢酶','糖尿病(0=无，1=有)','血_白蛋白','性别']            
['GLOB','Hypertension','LYMPH$\%$','Age','UA','A/G','LDH','Diabetes','ALB','Sex']
[0.040613,0.040831,0.042762,0.047818,0.052466,0.054474,0.058470,0.059124,0.080150,0.117900]

 
ElasticNetCV
['血_球蛋白','高血压(0=无，1=有)','血_淋巴细胞(%)','年龄','血_尿酸','血_白/球比值',
'血_乳酸脱氢酶','糖尿病(0=无，1=有)','血_白蛋白','性别']            
['GLOB','Hypertension','LYMPH$\%$','Age','UA','A/G','LDH','Diabetes','ALB','Sex']
[0.040072,0.040959,0.042388,0.047750,0.052413,0.053710,0.058350,0.059029,0.079351,0.117287]






RandomForest:
['血_RBC分布宽度SD', '血_白细胞计数','血_尿酸',
'年龄','血_中性粒细胞(#)','血_白蛋白', '血_D-D二聚体定量','血_乳酸脱氢酶', '血_中性粒细胞(%)','血_淋巴细胞(%)' ]    
 
['RDW_SD','WBC','UA','Age','Neu$\#$','ALB','D-Dimer','LDH','Neu$\%$','LYMPH$\%$']
[0.021680,0.022978,0.025657,0.031889,0.031962,0.032883, 0.035083,0.036349,0.036464,0.046962]






"""
x = ['RDW_SD', 'WBC', 'UA', 'Age', 'Neu$\#$', 'ALB', 'D-Dimer', 'LDH', 'Neu$\%$', 'LYMPH$\%$']
y = [0.021680, 0.022978, 0.025657, 0.031889, 0.031962, 0.032883, 0.035083, 0.036349, 0.036464, 0.046962]

plt.bar(x=x, height=y, width=0.5)
# rotation=45
# plt.xticks(fontsize=14, rotation=330)  # x轴上的标签旋转45度
# plt.yticks(fontsize=15)
plt.ylabel("Relative importance", fontsize=15)
plt.show()
