"""
临床结局部分
    绘制Top10因子的特征重要性
"""
import matplotlib.pyplot as plt
from pylab import *
mpl.rcParams['font.sans-serif'] = ['Arial']
plt.figure(figsize=(8, 7))


"""
LassoCV 

['血_凝血酶原时间','血_血红蛋白','血_白蛋白','血_淋巴细胞(#)','血_单核细胞(%)',
'血_血小板计数','血_超敏C反应蛋白','血_尿素','血_中性粒细胞(#)','血_乳酸脱氢酶'] 
['PT','HGB','ALB','LYMPH$\#$','Mono$\%$','PLT','hs-CRP','Urea','Neu$\#$','LDH']
[0.012171,0.020593,0.021731,0.023648,0.029288,0.03495,0.037614,0.044358,0.049047,0.066578]

ElasticNetCV

['血_凝血酶原时间','血_血红蛋白','血_白蛋白','血_淋巴细胞(#)','血_单核细胞(%)',
'血_血小板计数','血_超敏C反应蛋白','血_尿素','血_中性粒细胞(#)','血_乳酸脱氢酶'] 
['PT','HGB','ALB','LYMPH$\#$','Mono$\%$','PLT','hs-CRP','Urea','Neu$\#$','LDH']
[0.011135,0.019531,0.021310,0.023880,0.028468,0.033287,0.036547,0.043133,0.047794,0.064077]


RandomForest:

['血_白细胞计数','血_超敏C反应蛋白','血_单核细胞(%)','血_血小板计数','血_淋巴细胞(#)',
'血_中性粒细胞(#)','血_尿素','血_乳酸脱氢酶','血_中性粒细胞(%)','血_淋巴细胞(%)']  
['WBC','hs-CRP','Mono$\%$','PLT','LYMPH$\#$','Neu$\%$','Urea','LDH','Neu$\%$','LYMPH$\%$']
[0.025395,0.032364,0.032623,0.032922,0.039417,0.039594,0.042936,0.055759,0.073368,0.077733]

"""
x = ['PT','HGB','ALB','LYMPH$\#$','Mono$\%$','PLT','hs-CRP','Urea','Neu$\#$','LDH']
y = [0.012171,0.020593,0.021731,0.023648,0.029288,0.03495,0.037614,0.044358,0.049047,0.066578]


plt.bar(x=x, height=y, width=0.5)
# rotation=45
plt.xticks(fontsize=14, rotation=330)  # x轴上的标签旋转45度
plt.yticks(fontsize=15)
plt.ylabel("Relative importance", fontsize=12)
plt.savefig("../result/数据可视化/LassoCV-clinical_outcome.png")

plt.show()

